espressif/arduino-esp32/libraries/I2S/src/I2S.cpp
  if(_state != I2S_STATE_DUPLEX){
    _state = I2S_STATE_IDLE;
  }
}

void I2SClass::end()
{
  _take_if_not_holding();
  if(xTaskGetCurrentTaskHandle() != _callbackTaskHandle){
    _destroyCallbackTask();

    if(_initialized){
      _uninstallDriver();
      _initialized = false;
    }
    _onTransmit = NULL;
    _onReceive  = NULL;
    if(_input_ring_buffer != NULL){
      vRingbufferDelete(_input_ring_buffer);
      _input_ring_buffer = NULL;
    }
    if(_output_ring_buffer != NULL){
      vRingbufferDelete(_output_ring_buffer);
      _output_ring_buffer = NULL;
    }
  }else{
    log_w("WARNING: ending I2SClass from callback task not permitted, but attempted!");
  }
  _give_if_top_call();
}

// Bytes available to read
int I2SClass::available()
{
  _take_if_not_holding();
  int ret = _buffer_byte_size - (int)xRingbufferGetCurFreeSize(_input_ring_buffer);
  _give_if_top_call();
  return ret;
}

union i2s_sample_t {
  uint8_t b8;
  int16_t b16;
  int32_t b32;
};

int I2SClass::read()
{
  _take_if_not_holding();
  i2s_sample_t sample;
  sample.b32 = 0;
  read(&sample, _bitsPerSample / 8);

  if (_bitsPerSample == 32) {
    _give_if_top_call();
    return sample.b32;
  } else if (_bitsPerSample == 16) {
    _give_if_top_call();
    return sample.b16;
  } else if (_bitsPerSample == 8) {
    _give_if_top_call();
    return sample.b8;
  } else {
    _give_if_top_call();
    return 0;
  }
  _give_if_top_call();
  return 0;
}

int I2SClass::read(void* buffer, size_t size){
  _take_if_not_holding();
  if (_state != I2S_STATE_RECEIVER && _state != I2S_STATE_DUPLEX) {
    if(!_enableReceiver()){
      _give_if_top_call();
      return 0; // There was an error switching to receiver
    }
  }

  size_t item_size = 0;
  void *tmp_buffer;
  tmp_buffer = xRingbufferReceiveUpTo(_input_ring_buffer, &item_size, pdMS_TO_TICKS(1000), size);
  if(tmp_buffer != NULL){
    memcpy(buffer, tmp_buffer, item_size);
#if SOC_I2S_SUPPORTS_ADC_DAC
    if(_mode == I2S_ADC_DAC){
      for(size_t i = 0; i < item_size / 2; ++i){
        ((uint16_t*)buffer)[i] = ((uint16_t*)buffer)[i] & 0x0FFF;
      }
    } // ADC/DAC mode
#endif
    vRingbufferReturnItem(_input_ring_buffer, tmp_buffer);
    return item_size;
  }else{
    _give_if_top_call();
    return 0;
  }
  _give_if_top_call();
}

/*
size_t I2SClass::write(int sample)
{
  return write((int32_t)sample);
}
*/

size_t I2SClass::write(uint8_t data)
{
  _take_if_not_holding();
  size_t ret = write((int32_t)data);
  _give_if_top_call();
  return ret;
}

size_t I2SClass::write(int32_t sample)
{
  _take_if_not_holding();
  size_t ret = write(&sample, _bitsPerSample/8);
  _give_if_top_call();
  return ret;
}

size_t I2SClass::write(const uint8_t *buffer, size_t size)
{
  _take_if_not_holding();
  size_t ret = write((const void*)buffer, size);
  _give_if_top_call();
  return ret;
}

// blocking version of write
// TODO add timeout
size_t I2SClass::write_blocking(const void *buffer, size_t size)
{
  _take_if_not_holding();
  if (_state != I2S_STATE_TRANSMITTER && _state != I2S_STATE_DUPLEX) {
    if(!_enableTransmitter()){
      _give_if_top_call();
      return 0; // There was an error switching to transmitter
    }
  }
  // TODO add timeout
  while(availableForWrite() < size){
    yield();
  }
  if(pdTRUE == xRingbufferSend(_output_ring_buffer, buffer, size, 10)){
    _give_if_top_call();
    return size;
  }else{
    _give_if_top_call();
    return 0;
  }
  _give_if_top_call();
}

// non-blocking version of write
size_t I2SClass::write_nonblocking(const void *buffer, size_t size)
{
  _take_if_not_holding();
  if (_state != I2S_STATE_TRANSMITTER && _state != I2S_STATE_DUPLEX) {
    if(!_enableTransmitter()){
      _give_if_top_call();
      return 0; // There was an error switching to transmitter
    }
  }
  if(availableForWrite() < size){
    flush();
  }
  if(pdTRUE == xRingbufferSend(_output_ring_buffer, buffer, size, 10)){
    _give_if_top_call();
    return size;
  }else{
    _give_if_top_call();
    return 0;
  }
  _give_if_top_call();
}

size_t I2SClass::write(const void *buffer, size_t size){
  _take_if_not_holding();
  //size_t ret = write_blocking(buffer, size);
  size_t ret = write_nonblocking(buffer, size);
  _give_if_top_call();
  return ret;
}

int I2SClass::peek()
{
  _take_if_not_holding();
  // TODO
  // peek() is not implemented for ESP yet
  int ret = 0;
  _give_if_top_call();
  return ret;
}

void I2SClass::flush()
{
  _take_if_not_holding();
  const size_t single_dma_buf = _i2s_dma_buffer_size*(_bitsPerSample/8);
  size_t item_size = 0;
  size_t bytes_written;
  void *item = NULL;

  item = xRingbufferReceiveUpTo(_output_ring_buffer, &item_size, pdMS_TO_TICKS(1000), single_dma_buf);
  if (item != NULL){
    esp_i2s::i2s_write((esp_i2s::i2s_port_t) _deviceIndex, item, item_size, &bytes_written, 0);
    if(item_size != bytes_written){
    }
    vRingbufferReturnItem(_output_ring_buffer, item);
  }
  _give_if_top_call();
}

// Bytes available to write
int I2SClass::availableForWrite()
{
  _take_if_not_holding();
  int ret = (int)xRingbufferGetCurFreeSize(_output_ring_buffer);
  _give_if_top_call();
  return ret;
}

void I2SClass::onTransmit(void(*function)(void))
{
  _take_if_not_holding();
  _onTransmit = function;
  _give_if_top_call();
}

void I2SClass::onReceive(void(*function)(void))
{
  _take_if_not_holding();
  _onReceive = function;
  _give_if_top_call();
}

int I2SClass::setBufferSize(int bufferSize)
{
  _take_if_not_holding();
  if(bufferSize >= 8 && bufferSize <= 1024){
    _i2s_dma_buffer_size = bufferSize;
    if(_initialized){
      _uninstallDriver();
      _give_if_top_call();
      return _installDriver();
    }
    _give_if_top_call();
    return 1; // OK
  }else{
    _give_if_top_call();
    return 0; // ERR
  }
  _give_if_top_call();
}

int I2SClass::getBufferSize(){
  _take_if_not_holding();
  int ret = _i2s_dma_buffer_size;
  _give_if_top_call();
  return ret;
}

int I2SClass::_enableTransmitter()
{
  if(_state != I2S_STATE_DUPLEX && _state != I2S_STATE_TRANSMITTER){
    _state = I2S_STATE_TRANSMITTER;
    return _applyPinSetting();
  }
  return 1; // Ok
}

int I2SClass::_enableReceiver()
{
  if(_state != I2S_STATE_DUPLEX && _state != I2S_STATE_RECEIVER){
    _state = I2S_STATE_RECEIVER;
    return _applyPinSetting();
  }
  return 1; // Ok
}

