espressif/arduino-esp32/libraries/I2S/src/I2S.cpp
void I2SClass::_tx_done_routine(uint8_t* prev_item){
  static bool prev_item_valid = false;
  const size_t single_dma_buf = _i2s_dma_buffer_size*(_bitsPerSample/8);
  static size_t item_size = 0;
  static size_t prev_item_size = 0;
  static void *item = NULL;
  static int prev_item_offset = 0;
  static size_t bytes_written;

  if(prev_item_valid){ // use item from previous round
    esp_i2s::i2s_write((esp_i2s::i2s_port_t) _deviceIndex, prev_item+prev_item_offset, prev_item_size, &bytes_written, 0);
    if(prev_item_size == bytes_written){
      prev_item_valid = false;
    } // write size check
    prev_item_offset = bytes_written;
    prev_item_size -= bytes_written;
  } // prev_item_valid

  if(_buffer_byte_size - xRingbufferGetCurFreeSize(_output_ring_buffer) >= single_dma_buf){ // fill up the I2S DMA buffer
    bytes_written = 0;
    item_size = 0;
    //if(_buffer_byte_size - xRingbufferGetCurFreeSize(_output_ring_buffer) >= _i2s_dma_buffer_size*(_bitsPerSample/8)){ // don't read from almost empty buffer
    item = xRingbufferReceiveUpTo(_output_ring_buffer, &item_size, pdMS_TO_TICKS(1000), single_dma_buf);
    if (item != NULL){
      esp_i2s::i2s_write((esp_i2s::i2s_port_t) _deviceIndex, item, item_size, &bytes_written, 0);
      if(item_size != bytes_written){ // save item that was not written correctly for later
        memcpy(prev_item, (void*)&((uint8_t*)item)[bytes_written], item_size-bytes_written);
        prev_item_size = item_size - bytes_written;
        prev_item_offset = 0;
        prev_item_valid = true;
      } // save item that was not written correctly for later
      vRingbufferReturnItem(_output_ring_buffer, item);
    } // Check received item
  } // don't read from almost empty buffer

  if(_onTransmit){
    _onTransmit();
  } // user callback
}

void I2SClass::_rx_done_routine(){
  static size_t bytes_read;
  const size_t single_dma_buf = _i2s_dma_buffer_size*(_bitsPerSample/8);
  uint8_t *_inputBuffer = (uint8_t*)malloc(_i2s_dma_buffer_size*4);

  size_t avail = xRingbufferGetCurFreeSize(_input_ring_buffer);
  esp_i2s::i2s_read((esp_i2s::i2s_port_t) _deviceIndex, _inputBuffer, avail <= single_dma_buf ? avail : single_dma_buf, (size_t*) &bytes_read, 0);
  if(pdTRUE != xRingbufferSend(_input_ring_buffer, _inputBuffer, bytes_read, 0)){
    log_w("I2S failed to send item from DMA to internal buffer\n");
  }else{
    if (_onReceive) {
      _onReceive();
    } // user callback
  } // xRingbufferSendComplete
  free(_inputBuffer);
}

void I2SClass::_onTransferComplete()
{
  uint8_t prev_item[_i2s_dma_buffer_size*4];
  static QueueSetHandle_t xQueueSet;
  QueueSetMemberHandle_t xActivatedMember;
  esp_i2s::i2s_event_t i2s_event;
  xQueueSet = xQueueCreateSet(sizeof(i2s_event)*_I2S_EVENT_QUEUE_LENGTH + 1);
  configASSERT(xQueueSet);
  configASSERT(_i2sEventQueue);
  xQueueAddToSet(_i2sEventQueue, xQueueSet);
  xQueueAddToSet(_task_kill_cmd_semaphore_handle, xQueueSet);

  while(true){
    //xActivatedMember = xQueueSelectFromSet(xQueueSet, portMAX_DELAY); // defaul
    xActivatedMember = xQueueSelectFromSet(xQueueSet, 5); // hack
    // TODO try just queue receive at the timeout
    if(xActivatedMember == _task_kill_cmd_semaphore_handle){
      xSemaphoreTake(_task_kill_cmd_semaphore_handle, 0);
      break; // from the infinite loop
    //}else if(xActivatedMember == _i2sEventQueue){ // default
    }else if(xActivatedMember == _i2sEventQueue || xActivatedMember == NULL){ // hack
      if(uxQueueMessagesWaiting(_i2sEventQueue)){
        xQueueReceive(_i2sEventQueue, &i2s_event, 0);
        if(i2s_event.type == esp_i2s::I2S_EVENT_TX_DONE){
          _tx_done_routine(prev_item);
        }else if(i2s_event.type == esp_i2s::I2S_EVENT_RX_DONE){
         _rx_done_routine();
        } // RX Done
      } // queue not empty
    }else{
    }
  } // infinite loop
  _callbackTaskHandle = NULL; // prevent secondary termination to non-existing task
}

void I2SClass::onDmaTransferComplete(void*)
{
  I2S._onTransferComplete();
  vTaskDelete(NULL);
}

void I2SClass::_take_if_not_holding(){
  TaskHandle_t mutex_holder = xSemaphoreGetMutexHolder(_i2s_general_mutex);
  if(mutex_holder != NULL && mutex_holder == xTaskGetCurrentTaskHandle()){
    ++_nesting_counter;
    return; // we are already holding this mutex - no need to take it
  }

  // we are not holding the mutex - wait for it and take it
  if(xSemaphoreTake(_i2s_general_mutex, portMAX_DELAY) != pdTRUE ){
    log_e("I2S internal mutex take returned with error")
  }
  //_give_if_top_call(); // call after this function
}

void I2SClass::_give_if_top_call(){
  if(_nesting_counter){
    --_nesting_counter;
  }else{
    if(xSemaphoreGive(_i2s_general_mutex) != pdTRUE){
      log_e("I2S intternal mutex give error");
    }
  }
}

#if SOC_I2S_SUPPORTS_ADC_DAC
int I2SClass::gpioToAdcUnit(gpio_num_t gpio_num, esp_i2s::adc_unit_t* adc_unit){
  switch(gpio_num){
#if CONFIG_IDF_TARGET_ESP32
    // ADC 1
    case GPIO_NUM_36:
    case GPIO_NUM_37:
    case GPIO_NUM_38:
    case GPIO_NUM_39:
    case GPIO_NUM_32:
    case GPIO_NUM_33:
    case GPIO_NUM_34:
    case GPIO_NUM_35:
      *adc_unit = esp_i2s::ADC_UNIT_1;
      return 1; // OK

    // ADC 2
    case GPIO_NUM_0:
      log_w("GPIO 0 for ADC should not be used for dev boards due to external auto program circuits.");
    case GPIO_NUM_4:
    case GPIO_NUM_2:
    case GPIO_NUM_15:
    case GPIO_NUM_13:
    case GPIO_NUM_12:
    case GPIO_NUM_14:
    case GPIO_NUM_27:
    case GPIO_NUM_25:
    case GPIO_NUM_26:
      *adc_unit = esp_i2s::ADC_UNIT_2;
      return 1; // OK
#endif

#if (CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3)
    case GPIO_NUM_1:
    case GPIO_NUM_2:
    case GPIO_NUM_3:
    case GPIO_NUM_4:
    case GPIO_NUM_5:
    case GPIO_NUM_6:
    case GPIO_NUM_7:
    case GPIO_NUM_8:
    case GPIO_NUM_9:
    case GPIO_NUM_10:
      *adc_unit = esp_i2s::ADC_UNIT_1;
      return 1; // OK
#endif

#if CONFIG_IDF_TARGET_ESP32S2
    case GPIO_NUM_11:
    case GPIO_NUM_12:
    case GPIO_NUM_13:
    case GPIO_NUM_14:
    case GPIO_NUM_15:
    case GPIO_NUM_16:
    case GPIO_NUM_17:
    case GPIO_NUM_18:
    case GPIO_NUM_19:
    case GPIO_NUM_20:
      *adc_unit = esp_i2s::ADC_UNIT_2;
      return 1; // OK
#endif

